Revit 2027 API
TopographySurface.GetHostedSubRegionIds Method
 Gets the ids of all subregion elements hosted on this topography surface.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetHostedSubRegionIds()
Public Function GetHostedSubRegionIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetHostedSubRegionIds()
member GetHostedSubRegionIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The hosted subregion ids.
Exceptions
Exception | Condition
InvalidOperationException |  This element is not a TopographySurface.
Remarks
 This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad). This applies to TopographySurface and SiteSubRegion elements.
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace